<template>
  <div class="path">
    <p>Мне полных 34 года, живу и работаю в г. Кызыл Республики Тыва. У меня врожденный интерес к цифровым технологиям. Образование нету (9 класс).</p>
    <p>
      После совершеннолетия устроился работать системным администратором (эникейшик) в районную администрацию. Проработав там, буквально, 2 месяца, устроился
      системным администратором + эникейшик в госучреждение в столице республики. В промежутке с 2009 по 2011 занимался разным родом деятельности.
    </p>
    <p>
      Самое интересное началось в конце 2011-го, когда устроился в местную телекомпанию. В телекомпании я проработал 9 лет, из-них 4 года начальником IT-отдела.
      Все это время не раз задумывался изучить программирование. Думал, начну с PHP, но дальше “думал”, никуда не прогрессировало. В июне 2019-го, в одно
      прекрасное утро, листая новостную ленту в соцсетях, случайно забрел в образовательную платформу GeekBrains. В результате, я приобрел курсы по направлению
      фронтэнд разработки из абсолюно, случайно завалявшихся “денюжек”, что у меня были. В начале 2020-го. на работе произошли больше изменения, из-за чего я
      уволился. Немалое значение на принятие мной такого решения оказал тяга к программированию. Появилось много времени для “любимого дела”, чем я и занялся.
    </p>
    <p>Мои недостатки: Заброшенная учеба. Непонятный уровень знания английского языка.</p>
    <p>Мои преимущества: Не считаю свои недостатки “большой проблемой”; Программирование и администрирование ИС - это мое хобби и работа.</p>
  </div>
</template>

<script lang="ts">
import { defineComponent } from "vue";
export default defineComponent({
  name: "PathToProgramming",
});
</script>

<style lang="scss"></style>
