<template>
  <div class="path">
    <p>Мне полных 34 года, живу и работаю в г. Кызыл Республики Тыва. Образование нету (9 класс).</p>
    <p>
      После совершеннолетия устроился работать системным администратором (эникейшик) в районную администрацию. Проработав там, буквально, 2 месяца, устроился
      системным администратором + эникейшик в госучреждение в столице республики. В промежутке с 2009 по 2011 занимался разным родом деятельности.
    </p>
    <p>
      В конце 2011-го устроился в местную телекомпанию. В начале 2020-го. на работе произошли больше изменения, из-за чего я уволился. В телекомпании я
      проработал 9 лет, из-них 4 года начальником IT-отдела. Немалое значение на принятие мной такого решения оказал тяга к программированию. Появилось много
      времени для “любимого дела”, чем я и занялся.
    </p>
    <p>
      Все это время не раз задумывался об изучении программирования. На уме ходили мысли: "А начну-ка, я, с PHP", но дальше “мыслей”, никуда не прогрессировало.
      В июне 2019-го, в одно прекрасное утро, листая новостную ленту в соцсетях, случайно забрел в образовательную платформу GeekBrains. В результате, я
      приобрел курсы по направлению фронтэнд разработки из абсолюно, случайно завалявшихся “денюжек”, что у меня были.
    </p>
    <p>Мои недостатки: Заброшенная учеба. Непонятный уровень знания английского языка. Где-то между А1 и А2</p>
    <p>
      Мои преимущества: Не считаю свои недостатки “большой проблемой”;Врожденный интерес к технологиям; Программирование и администрирование ИС - это мое хобби
      и работа.
    </p>
  </div>
</template>

<script lang="ts">
import { defineComponent } from "vue";
export default defineComponent({
  name: "PathToProgramming",
});
</script>

<style lang="scss"></style>
