<template>
  <div class="path">
    <h1 class="path__title title">Становление разработчиком</h1>
    <p>&emsp;&emsp;Мне полных 34 года, живу и работаю в г. Кызыл Республики Тыва. Образование нету (9 класс).</p>
    <p>
      &emsp;&emsp;После совершеннолетия устроился работать системным администратором (эникейшик) в районную администрацию. Проработав там, буквально, 2 месяца,
      устроился системным администратором + эникейшик в госучреждение в столице республики. В промежутке с 2009 по 2011 занимался разным родом деятельности.
    </p>
    <p>
      &emsp;&emsp;В конце 2011-го устроился в местную телекомпанию. В начале 2020-го. на работе произошли больше изменения, из-за чего я уволился. В
      телекомпании я проработал 9 лет, из-них 4 года начальником IT-отдела. Немалое значение на принятие мной такого решения оказал тяга к программированию.
      Появилось много времени для “любимого дела”, чем я и занялся.
    </p>
    <p>
      &emsp;&emsp;Все это время не раз задумывался об изучении программирования. На уме ходили мысли: "А начну-ка, я, с PHP", но дальше “мыслей”, никуда не
      прогрессировало. В июне 2019-го, в одно прекрасное утро, листая новостную ленту в соцсетях, случайно забрел в образовательную платформу GeekBrains. В
      результате, я приобрел курсы по направлению фронтэнд разработки из абсолюно, случайно завалявшихся “денюжек”, что у меня были.
    </p>
    <p></p>
    <dl>
      <dt>Мои недостатки:</dt>
      <dd>
        <ul type="circle">
          <li>Заброшенная учеба;</li>
        </ul>
        <ul type="circle">
          <li>Непонятный уровень знания английского языка. Где-то между А1 и А2.</li>
        </ul>
      </dd>
    </dl>
    <dl>
      <dt>Мои преимущества:</dt>
      <dd>
        <ul type="circle">
          <li>Не считаю свои недостатки “большой проблемой”;</li>
        </ul>
        <ul type="circle">
          <li>Врожденный интерес к современным информационным технологиям;</li>
        </ul>
        <ul type="circle">
          <li>Программирование и администрирование ИС - это мое хобби и работа.</li>
        </ul>
      </dd>
    </dl>
  </div>
</template>

<script lang="ts">
import { defineComponent } from "vue";
export default defineComponent({
  name: "PathToProgramming",
});
</script>

<style lang="scss">
.path {
  margin: 0 auto;
  & p {
    word-break: break-word;
  }
}
</style>
