<template>
  <div class="path">
    <h1 class="path__title title">Становление разработчиком</h1>
    <p>&emsp;&emsp;Мне 34 года, живу и работаю в г. Кызыл Республики Тыва. Образование неполное среднее.</p>
    <p>
      &emsp;&emsp;После окончания школы устроился работать системным администратором (эникейшик) в районную администрацию. Проработав 2 месяца, устроился
      системным администратором + эникейшик в госучреждение в столице республики. В промежутке с 2009 по 2011 занимался разными видами деятельности.
    </p>
    <p>
      &emsp;&emsp;В конце 2011 года начал работать в местной телекомпании. В начале 2020 года в телекомпании произошли большие изменения, что привело к моему
      увольнению по собственному желанию. В телекомпании я проработал 9 лет, из них 4 года начальником IT-отдела. Существенное значение на принятие решения об
      увольнении с телекомпании оказала тяга к программированию. Появилось много времени для “любимого дела”, который с каждым новым знанием укрепил ориентир в
      программирование.
    </p>
    <p>
      &emsp;&emsp;За время работы в разных организациях мысль об изучении программирования не покидала меня. Вначале были думы о старте работы с PHP, но дальше
      просто “мыслей” задумка не прогрессировала. В июне 2019 года, листая новостную ленту в социальных сетях, случайно попал в образовательную платформу
      GeekBrains. В результате, я приобрел курсы по направлению фронтэнд разработки, в которые я удачно вложил свои свободные финансы.
    </p>
    <p></p>
    <dl>
      <dt>Мои недостатки:</dt>
      <dd>
        <ul type="circle">
          <li>Заброшенная учеба;</li>
        </ul>
        <ul type="circle">
          <li>Недостаточный уровень знания английского языка. Где-то между А1 и А2.</li>
        </ul>
      </dd>
    </dl>
    <dl>
      <dt>Мои преимущества:</dt>
      <dd>
        <ul type="circle">
          <li>Не считаю свои недостатки “большой проблемой”;</li>
        </ul>
        <ul type="circle">
          <li>Серьезно интересуюсь современными информационными технологиями;</li>
        </ul>
        <ul type="circle">
          <li>Программирование и администрирование ИС - это мое хобби и работа.</li>
        </ul>
      </dd>
    </dl>
  </div>
</template>

<script lang="ts">
import { defineComponent } from "vue";
export default defineComponent({
  name: "PathToProgramming",
});
</script>

<style lang="scss">
.path {
  margin: 0 auto;
  & p {
    word-break: break-word;
  }
}
</style>
